balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ32GS610.PIC
        <edc:SFRDef edc:access="nn----nnnnnnnnnn" edc:cname="IFS6" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----0000000000" edc:name="IFS6" edc:nzwidth="0x10" edc:por="00----0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM3IF" edc:desc="" edc:mask="0x1" edc:name="PWM3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM4IF" edc:desc="" edc:mask="0x1" edc:name="PWM4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM5IF" edc:desc="" edc:mask="0x1" edc:name="PWM5IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6IF" edc:desc="" edc:mask="0x1" edc:name="PWM6IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM7IF" edc:desc="" edc:mask="0x1" edc:name="PWM7IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM8IF" edc:desc="" edc:mask="0x1" edc:name="PWM8IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM9IF" edc:desc="" edc:mask="0x1" edc:name="PWM9IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AC2IF" edc:desc="" edc:mask="0x1" edc:name="AC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC3IF" edc:desc="" edc:mask="0x1" edc:name="AC3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC4IF" edc:desc="" edc:mask="0x1" edc:name="AC4IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ADCP0IF" edc:desc="" edc:mask="0x1" edc:name="ADCP0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP1IF" edc:desc="" edc:mask="0x1" edc:name="ADCP1IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="IFS7" edc:desc="" edc:impl="0x20db" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000" edc:name="IFS7" edc:nzwidth="0x10" edc:por="----------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ADCP2IF" edc:desc="" edc:mask="0x1" edc:name="ADCP2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP3IF" edc:desc="" edc:mask="0x1" edc:name="ADCP3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP4IF" edc:desc="" edc:mask="0x1" edc:name="ADCP4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP5IF" edc:desc="" edc:mask="0x1" edc:name="ADCP5IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP6IF" edc:desc="" edc:mask="0x1" edc:name="ADCP6IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP7IF" edc:desc="" edc:mask="0x1" edc:name="ADCP7IF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnnnnn-nnnn" edc:cname="IEC0" edc:desc="" edc:impl="0x3fef" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000000-0000" edc:name="IEC0" edc:nzwidth="0x10" edc:por="--000000000-0000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IE" edc:desc="" edc:mask="0x1" edc:name="INT0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IC1IE" edc:desc="" edc:mask="0x1" edc:name="IC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC1IE" edc:desc="" edc:mask="0x1" edc:name="OC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1IE" edc:desc="" edc:mask="0x1" edc:name="T1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC2IE" edc:desc="" edc:mask="0x1" edc:name="IC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OC2IE" edc:desc="" edc:mask="0x1" edc:name="OC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T2IE" edc:desc="" edc:mask="0x1" edc:name="T2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T3IE" edc:desc="" edc:mask="0x1" edc:name="T3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1EIE" edc:desc="" edc:mask="0x1" edc:name="SPI1EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IE" edc:desc="" edc:mask="0x1" edc:name="SPI1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1RXIE" edc:desc="" edc:mask="0x1" edc:name="U1RXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIE" edc:desc="" edc:mask="0x1" edc:name="U1TXIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIE" edc:desc="" edc:mask="0x1" edc:name="ADIE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnn----nnnnn" edc:cname="IEC1" edc:desc="" edc:impl="0x20db" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000----00000" edc:name="IEC1" edc:nzwidth="0x10" edc:por="0000000----00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SI2C1IE" edc:desc="" edc:mask="0x1" edc:name="SI2C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MI2C1IE" edc:desc="" edc:mask="0x1" edc:name="MI2C1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC1IE" edc:desc="" edc:mask="0x1" edc:name="AC1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CNIE" edc:desc="" edc:mask="0x1" edc:name="CNIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IE" edc:desc="" edc:mask="0x1" edc:name="INT1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OC3IE" edc:desc="" edc:mask="0x1" edc:name="OC3IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OC4IE" edc:desc="" edc:mask="0x1" edc:name="OC4IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T4IE" edc:desc="" edc:mask="0x1" edc:name="T4IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T5IE" edc:desc="" edc:mask="0x1" edc:name="T5IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2IE" edc:desc="" edc:mask="0x1" edc:name="INT2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXIE" edc:desc="" edc:mask="0x1" edc:name="U2RXIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U2TXIE" edc:desc="" edc:mask="0x1" edc:name="U2TXIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------nn---nn" edc:cname="IEC2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------00---00" edc:name="IEC2" edc:nzwidth="16" edc:por="---------00---00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI2EIE" edc:desc="" edc:mask="0x1" edc:name="SPI2EIE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPI2IE" edc:desc="" edc:mask="0x1" edc:name="SPI2IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC3IE" edc:desc="" edc:mask="0x1" edc:name="IC3IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC4IE" edc:desc="" edc:mask="0x1" edc:name="IC4IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nn--nn--nn-" edc:cname="IEC3" edc:desc="" edc:impl="0x602" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----00--00--00-" edc:name="IEC3" edc:nzwidth="0x10" edc:por="-----00--00--00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SI2C2IE" edc:desc="" edc:mask="0x1" edc:name="SI2C2IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MI2C2IE" edc:desc="" edc:mask="0x1" edc:name="MI2C2IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="INT3IE" edc:desc="" edc:mask="0x1" edc:name="INT3IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT4IE" edc:desc="" edc:mask="0x1" edc:name="INT4IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PSEMIE" edc:desc="" edc:mask="0x1" edc:name="PSEMIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="QEI1IE" edc:desc="" edc:mask="0x1" edc:name="QEI1IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----n-n------nn-" edc:cname="IEC4" edc:desc="" edc:impl="0x602" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0-0------00-" edc:name="IEC4" edc:nzwidth="0x10" edc:por="----0-0------00-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="U1EIE" edc:desc="" edc:mask="0x1" edc:name="U1EIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIE" edc:desc="" edc:mask="0x1" edc:name="U2EIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="PSESMIE" edc:desc="" edc:mask="0x1" edc:name="PSESMIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="QEI2IE" edc:desc="" edc:mask="0x1" edc:name="QEI2IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn--------nnnn-" edc:cname="IEC5" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--------xxx0-" edc:name="IEC5" edc:nzwidth="0x10" edc:por="000--------xxx0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP8IE" edc:desc="" edc:mask="0x1" edc:name="ADCP8IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP9IE" edc:desc="" edc:mask="0x1" edc:name="ADCP9IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP10IE" edc:desc="" edc:mask="0x1" edc:name="ADCP10IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADCP11IE" edc:desc="" edc:mask="0x1" edc:name="ADCP11IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="ADCP12IE" edc:desc="" edc:mask="0x1" edc:name="ADCP12IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM1IE" edc:desc="" edc:mask="0x1" edc:name="PWM1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IE" edc:desc="" edc:mask="0x1" edc:name="PWM2IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn----nnnnnnnnnn" edc:cname="IEC6" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00----0000000000" edc:name="IEC6" edc:nzwidth="0x10" edc:por="00----0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM3IE" edc:desc="" edc:mask="0x1" edc:name="PWM3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM4IE" edc:desc="" edc:mask="0x1" edc:name="PWM4IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM5IE" edc:desc="" edc:mask="0x1" edc:name="PWM5IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM6IE" edc:desc="" edc:mask="0x1" edc:name="PWM6IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM7IE" edc:desc="" edc:mask="0x1" edc:name="PWM7IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM8IE" edc:desc="" edc:mask="0x1" edc:name="PWM8IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PWM9IE" edc:desc="" edc:mask="0x1" edc:name="PWM9IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="AC2IE" edc:desc="" edc:mask="0x1" edc:name="AC2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC3IE" edc:desc="" edc:mask="0x1" edc:name="AC3IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="AC4IE" edc:desc="" edc:mask="0x1" edc:name="AC4IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ADCP0IE" edc:desc="" edc:mask="0x1" edc:name="ADCP0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP1IE" edc:desc="" edc:mask="0x1" edc:name="ADCP1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
